Retrieves a box that encloses the geometry element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public BoundingBoxXYZ GetBoundingBox()
  Visual Basic
Public Function GetBoundingBox As BoundingBoxXYZ
  Visual C++
public:
BoundingBoxXYZ^ GetBoundingBox()
 Return Value
 The bounding box.
 See Also
  GeometryElement Class
  Autodesk.Revit.DB Namespace